Revit 2026 API

# ExternalServices Class

---

Provides a container of all Revit built-in ExternalServiceId instances.

SystemObject Autodesk.Revit.DB.ExternalServiceExternalServices

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ExternalServices
```
```vb
Public NotInheritable Class ExternalServices
```
```cpp
public ref class ExternalServices abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalServices = class end
```

#### Reference

Autodesk.Revit.DB.ExternalService Namespace